stress-backend.yml
config:
  target: "http://localhost:4000"
  http:
    headers:
      x-test-mode: "true"
  phases:
    - duration: 10
      arrivalCount: 3
      name: "Functional tests"
    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: "Load test"
  ensure:
    maxErrorRate: 1
    p95: 800

scenarios:
  # 70% of users complete check-ins
  - weight: 70
    name: "Complete check-in process"
    flow:
      - get:
          url: "/api/challenges"
          expect:
            - statusCode: 200
      - think: 2
      
      - get:
          url: "/api/challenges/6931d5ff08cb87b6c057183f/check-ins/me"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/challenges/6931d5ff08cb87b6c057183f/leaderboard"
          expect:
            - statusCode: 200
      - think: 3
      
      - post:
          url: "/api/challenges/6931d5ff08cb87b6c057183f/check-ins"
          json:
            day: "{{ $randomNumber(1, 7) }}"
            pointsEarned: 25
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/challenges/6931d5ff08cb87b6c057183f/check-ins/me"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/challenges/6931d5ff08cb87b6c057183f/leaderboard"
          expect:
            - statusCode: 200

  # 30% of users just browse
  - weight: 30
    name: "Browse challenges"
    flow:
      - get:
          url: "/api/challenges"
          expect:
            - statusCode: 200
      - think: 3