stress-backend.yml
config:
  target: "http://localhost:4000"
  phases:
    # Quick functional tests (runs once)
    - duration: 10
      arrivalCount: 3
      name: "Functional tests"
    # Load test (simulates real traffic)
    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: "Load test"
  ensure:
    maxErrorRate: 1
    p95: 800

scenarios:
  # Test auth works
  - weight: 10
    name: "Test login"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "testuser1@example.com"
            password: "password123"
          expect:
            - statusCode: 200
            - hasHeader: "set-cookie"

  # Test main user flow (most important)
  - weight: 70
    name: "Complete check-in process"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "testuser{{ $randomNumber(1, 5) }}@example.com"
            password: "Password123!"
          capture:
            - header: "set-cookie"
              as: "authCookie"
              regexp: "token=([^;]+)"
      
      - get:
          url: "/api/challenges"
          headers:
            Cookie: "token={{ authCookie }}"
          expect:
            - statusCode: 200
      - think: 2
      
      - get:
          url: "/api/challenges/675e4adbe6c72baaeb07c20f/check-ins/me"
          headers:
            Cookie: "token={{ authCookie }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/challenges/675e4adbe6c72baaeb07c20f/leaderboard"
          headers:
            Cookie: "token={{ authCookie }}"
          expect:
            - statusCode: 200
      - think: 3
      
      - post:
          url: "/api/challenges/675e4adbe6c72baaeb07c20f/check-ins"
          headers:
            Cookie: "token={{ authCookie }}"
          json:
            day: "{{ $randomNumber(1, 7) }}"
            value: "{{ $randomNumber(50, 150) }}"
            pointsEarned: 25
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/challenges/675e4adbe6c72baaeb07c20f/check-ins/me"
          headers:
            Cookie: "token={{ authCookie }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/challenges/675e4adbe6c72baaeb07c20f/leaderboard"
          headers:
            Cookie: "token={{ authCookie }}"
          expect:
            - statusCode: 200

  # Test browsing
  - weight: 20
    name: "Browse challenges"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "testuser{{ $randomNumber(1, 5) }}@example.com"
            password: "password123"
          capture:
            - header: "set-cookie"
              as: "authCookie"
              regexp: "token=([^;]+)"
      
      - get:
          url: "/api/challenges"
          headers:
            Cookie: "token={{ authCookie }}"
          expect:
            - statusCode: 200
      - think: 2-4